Interface.Post.Goods.Receipt.PWS.To.CDM/Interface.Linfox.PGR.PWSToCDM.Tests/TestData/In/PGR - PWS To CDM - XSLT Basic Test.xml

<SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" 
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" 
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema">
    <SOAP-ENV:Header></SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns0:PostGoodsReceipt 
            xmlns:ns0="http://linfoxintegration.com/horizon/postgoodsreceipt/1.0">
            <ns0:MessageHeader>
                <ns0:ID>PURCH00128</ns0:ID>
                <ns0:CreationDate>2017-03-10T08:48:15</ns0:CreationDate>
                <ns0:GLNCode>22868</ns0:GLNCode>
                <ns0:CustomerName></ns0:CustomerName>
                <ns0:WarehouseLocationCode>NSW1</ns0:WarehouseLocationCode>
                <ns0:TestIndicator>T</ns0:TestIndicator>
            </ns0:MessageHeader>
            <ns0:GRHeader>
                <ns0:WMSDocNumber>22868SIT20170309_3</ns0:WMSDocNumber>
                <ns0:PrmCustDocRefNo>22868SIT20170309_3</ns0:PrmCustDocRefNo>
                <ns0:PrimCustDocType>RQ</ns0:PrimCustDocType>
                <ns0:GRType>RQ</ns0:GRType>
                <ns0:AddnRefNumber1></ns0:AddnRefNumber1>
                <ns0:AddnRefNumber2>22868</ns0:AddnRefNumber2>
                <ns0:AddnRefNumber3>SHISHIR09_</ns0:AddnRefNumber3>
                <ns0:GRDate>2017-03-09</ns0:GRDate>
                <ns0:GRTime>00:00:01</ns0:GRTime>
                <ns0:WayBillID></ns0:WayBillID>
                <ns0:ContainerID></ns0:ContainerID>
            </ns0:GRHeader>
            <ns0:GRItemLevel>
                <ns0:GRItem>
                    <ns0:WMSDeliveryLineItem>1</ns0:WMSDeliveryLineItem>
                    <ns0:PrmCustOrderNumber>SIT20170309_3</ns0:PrmCustOrderNumber>
                    <ns0:PrmCustOrderLineItmNumber>0</ns0:PrmCustOrderLineItmNumber>
                    <ns0:AddnRefNumber1></ns0:AddnRefNumber1>
                    <ns0:AddnRefNumber2></ns0:AddnRefNumber2>
                    <ns0:AddnRefNumber3>SHISHIR09_</ns0:AddnRefNumber3>
                    <ns0:AddnRefNumber4>1.7702222</ns0:AddnRefNumber4>
                    <ns0:AddnRefNumber5/>
                    <ns0:MaterialCode>22868F8W727DS</ns0:MaterialCode>
                    <ns0:MaterialName>SCRNOVRLY,PET,IP-31,MX,ANTI-GLARE</ns0:MaterialName>
                    <ns0:GTINCode>2286810745883721778</ns0:GTINCode>
                    <ns0:StockCategory>
                        <ns0:StockCategoryType>43</ns0:StockCategoryType>
                        <ns0:Quantity>20</ns0:Quantity>
                        <ns0:QuantityUOM>EA</ns0:QuantityUOM>
                        <ns0:BatchDetails>
                            <ns0:Batch>
                                <ns0:VendorBatchCode></ns0:VendorBatchCode>
                                <ns0:WMSBatchCode>7068</ns0:WMSBatchCode>
                                <ns0:SLEDorBBD>2017-03-09</ns0:SLEDorBBD>
                            </ns0:Batch>
                        </ns0:BatchDetails>
                    </ns0:StockCategory>
                </ns0:GRItem>
            </ns0:GRItemLevel>
            <ns0:HandlingUnitDetails>
                <ns0:HandlingUnit>
                    <ns0:HUNumber>393333330000554152</ns0:HUNumber>
                    <ns0:PackagingMaterialType></ns0:PackagingMaterialType>
                    <ns0:PackagingMaterialName></ns0:PackagingMaterialName>
                    <ns0:GrossWeightOfHandlingUnit>0</ns0:GrossWeightOfHandlingUnit>
                    <ns0:NetWeightOfHandlingUnit>0</ns0:NetWeightOfHandlingUnit>
                    <ns0:WeightUOMOfHandlingUnit>KG</ns0:WeightUOMOfHandlingUnit>
                    <ns0:HULine>
                        <ns0:WMSDeliveryNumber>22868SIT20170309_3</ns0:WMSDeliveryNumber>
                        <ns0:WMSDeliveryLineItem>1</ns0:WMSDeliveryLineItem>
                        <ns0:PrmCustOrderNumber>SHISHIR09_</ns0:PrmCustOrderNumber>
                        <ns0:PrmCustOrderLineItmNumber>0</ns0:PrmCustOrderLineItmNumber>
                        <ns0:MaterialCode>22868F8W727DS</ns0:MaterialCode>
                        <ns0:StockCategory>
                            <ns0:StockCategoryType>43</ns0:StockCategoryType>
                            <ns0:Quantity>20</ns0:Quantity>
                            <ns0:QuantityUOM>EA</ns0:QuantityUOM>
                            <ns0:BatchDetails>
                                <ns0:Batch>
                                    <ns0:VendorBatchCode></ns0:VendorBatchCode>
                                    <ns0:WMSBatchCode>7068</ns0:WMSBatchCode>
                                    <ns0:SLEDorBBD>2017-03-09</ns0:SLEDorBBD>
                                </ns0:Batch>
                            </ns0:BatchDetails>
                        </ns0:StockCategory>
                    </ns0:HULine>
                </ns0:HandlingUnit>
            </ns0:HandlingUnitDetails>
        </ns0:PostGoodsReceipt>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>